Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/portals_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: portals title: Portals permalink: docs/portals.html ---
ja: --- id: portals title: ポータル permalink: docs/portals.html ---

source: Portals provide a first-class way to render children into a DOM node that exists outside the DOM hierarchy of the parent component.
ja: ポータル (portal) は、親コンポーネントの DOM 階層外にある DOM ノードに対して子コンポーネントをレンダーするための公式の仕組みを提供します。

source: The first argument (`child`) is any [renderable React child](/docs/react-component.html#render), such as an element, string, or fragment.
ja: 第 1 引数 (`child`) は [React の子要素としてレンダー可能なもの](/docs/react-component.html#render)、例えば、要素、文字列、フラグメントなどです。

source: The second argument (`container`) is a DOM element.
ja: 第 2 引数 (`container`) は DOM 要素を指定します。

source: ## Usage {#usage}
ja: ## 使い方 {#usage}

source: Normally, when you return an element from a component's render method, it's mounted into the DOM as a child of the nearest parent node:
ja: 通常、コンポーネントの `render` メソッドから要素を返すと、最も近い親ノードの子として DOM にマウントされます。

source: // React mounts a new div and renders the children into it
ja: // React は新しい div 要素をマウントし、子をその中に描画します

source: However, sometimes it's useful to insert a child into a different location in the DOM:
ja: しかし、時に子要素を DOM 上の異なる位置に挿入したほうが便利なことがあります。

source: // React does *not* create a new div.
ja: // React は新しい div をつくり*ません*。

source: It renders the children into `domNode`.
ja: 子要素は `domNode` に対して描画されます。

source: // `domNode` is any valid DOM node, regardless of its location in the DOM.
ja: // `domNode` は DOM ノードであれば何でも良く、 DOM 構造内のどこにあるかは問いません。

source: A typical use case for portals is when a parent component has an `overflow: hidden` or `z-index` style, but you need the child to visually "break out" of its container.
ja: ポータルの典型的なユースケースとは、親要素が `overflow: hidden` や `z-index` のスタイルを持っていても、子要素がコンテナを「飛び出して」見える必要があるものです。

source: For example, dialogs, hovercards, and tooltips.
ja: 例えば、ダイアログ、ホバーカード、ツールチップがそれに当たります。

source: > Note: > > When working with portals, remember that [managing keyboard focus](/docs/accessibility.html#programmatically-managing-focus) becomes very important.
ja: > 補足 > > ポータルを利用する際は、[キーボードのフォーカスの管理](/docs/accessibility.html#programmatically-managing-focus)を行うことが重要になるので、忘れずに行ってください。

source: > > For modal dialogs, ensure that everyone can interact with them by following the [WAI-ARIA Modal Authoring Practices](https://www.w3.org/TR/wai-aria-practices-1.1/#dialog_modal).
ja: > > モーダルダイアログについては [WAI-ARIA モーダルの推奨実装方法](https://www.w3.org/TR/wai-aria-practices-1.1/#dialog_modal)に従い、誰もが利用できるという状態を確保してください。

source: ## Event Bubbling Through Portals {#event-bubbling-through-portals}
ja: ## ポータルを介したイベントのバブリング {#event-bubbling-through-portals}

source: Even though a portal can be anywhere in the DOM tree, it behaves like a normal React child in every other way.
ja: ポータルは DOM ツリーのどこにでも存在できますが、他のあらゆる点では通常の React の子要素と変わらずに振る舞います。

source: Features like context work exactly the same regardless of whether the child is a portal, as the portal still exists in the *React tree* regardless of position in the *DOM tree*.
ja: コンテクスト (context) のような機能は、たとえ子要素がポータルであろうと全く同じように動きます。というのも、*DOM ツリー*上の位置にかかわらず、ポータルは依然として *React のツリー*内にいるからです。

source: This includes event bubbling.
ja: これにはイベントのバブリングも含まれます。

source: An event fired from inside a portal will propagate to ancestors in the containing *React tree*, even if those elements are not ancestors in the *DOM tree*.
ja: ポータルの内部で発火したイベントは *React のツリー*内の祖先へと伝播します。たとえそれが *DOM ツリー*上では祖先でなくともです。

source: Assuming the following HTML structure:
ja: 次のような HTML 構造があったとして、

source: A `Parent` component in `#app-root` would be able to catch an uncaught, bubbling event from the sibling node `#modal-root`.
ja: `#app-root` 内にある `Parent` コンポーネントは、`#modal-root` 内のコンポーネントから伝播したイベントが捕捉されなかった場合に、それを捕捉できます。

source: ```js{28-31,42-49,53,61-63,70-71,74} // These two containers are siblings in the DOM const appRoot = document.getElementById('app-root'); const modalRoot = document.getElementById('modal-root');
ja: ```js{28-31,42-49,53,61-63,70-71,74} // この 2 つのコンテナは DOM 上の兄弟要素とします const appRoot = document.getElementById('app-root'); const modalRoot = document.getElementById('modal-root');

source: // The portal element is inserted in the DOM tree after
ja: // ポータルの要素が DOM ツリーに挿入されるのは、

source: // the Modal's children are mounted, meaning that children
ja: // Modal の子要素がマウントされた後になります。

source: // will be mounted on a detached DOM node.
ja: // つまり、子要素は一旦どこにも結びつかない

source: If a child // component requires to be attached to the DOM tree
ja: // DOM ノードへとマウントされるということです。

source: // immediately when mounted, for example to measure a
ja: // もし子コンポーネントがマウント後すぐに DOM ツリーに結びついてほしい ――

source: // DOM node, or uses 'autoFocus' in a descendant, add
ja: // たとえば DOM ノードの大きさを測りたい、子孫要素で `autoFocus` を使いたいなど

source: // state to Modal and only render the children when Modal
ja: // ―― 場合は、 Modal に状態を持たせて Modal が

source: // is inserted in the DOM tree.
ja: // DOM ツリーに挿入されているときだけ子要素をレンダーするようにします。

source: // This will fire when the button in Child is clicked,
ja: // これは Child 内のボタンがクリックされた際に発火し、

source: // updating Parent's state, even though button
ja: // Parent の state を更新します。

source: // is not direct descendant in the DOM.
ja: // たとえそのボタンが DOM 上では直系の子孫でなかったとしてもです。

source: // The click event on this button will bubble up to parent,
ja: // クリックするとイベントが親に伝播します。

source: // because there is no 'onClick' attribute defined
ja: // なぜならここには `onClick` 属性が定義されてないからです。

source: Catching an event bubbling up from a portal in a parent component allows the development of more flexible abstractions that are not inherently reliant on portals.
ja: ポータルから伝播したイベントが親コンポーネントで捕捉できるということは、ポータルに本質的に依存することのない、より柔軟な抽象化が可能であるということを示しています。

source: For example, if you render a `<Modal />` component, the parent can capture its events regardless of whether it's implemented using portals.
ja: たとえば `<Modal />` の実装がポータルを使っているかに関係なく、`<Modal />` コンポーネントをレンダーしてそこから来るイベントを捕捉することができます。
